Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS610.h
#define ADCPC2 ADCPC2
extern volatile unsigned int  ADCPC2 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC2BITS {
  union {
    struct {
      unsigned TRGSRC4:5;
      unsigned SWTRG4:1;
      unsigned PEND4:1;
      unsigned IRQEN4:1;
      unsigned TRGSRC5:5;
      unsigned SWTRG5:1;
      unsigned PEND5:1;
      unsigned IRQEN5:1;
    };
    struct {
      unsigned TRGSRC40:1;
      unsigned TRGSRC41:1;
      unsigned TRGSRC42:1;
      unsigned TRGSRC43:1;
      unsigned TRGSRC44:1;
      unsigned :3;
      unsigned TRGSRC50:1;
      unsigned TRGSRC51:1;
      unsigned TRGSRC52:1;
      unsigned TRGSRC53:1;
      unsigned TRGSRC54:1;
    };
  };
} ADCPC2BITS;
extern volatile ADCPC2BITS ADCPC2bits __attribute__((__sfr__));

#define ADCPC3 ADCPC3
extern volatile unsigned int  ADCPC3 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC3BITS {
  union {
    struct {
      unsigned TRGSRC6:5;
      unsigned SWTRG6:1;
      unsigned PEND6:1;
      unsigned IRQEN6:1;
      unsigned TRGSRC7:5;
      unsigned SWTRG7:1;
      unsigned PEND7:1;
      unsigned IRQEN7:1;
    };
    struct {
      unsigned TRGSRC60:1;
      unsigned TRGSRC61:1;
      unsigned TRGSRC62:1;
      unsigned TRGSRC63:1;
      unsigned TRGSRC64:1;
      unsigned :3;
      unsigned TRGSRC70:1;
      unsigned TRGSRC71:1;
      unsigned TRGSRC72:1;
      unsigned TRGSRC73:1;
      unsigned TRGSRC74:1;
    };
  };
} ADCPC3BITS;
extern volatile ADCPC3BITS ADCPC3bits __attribute__((__sfr__));

#define ADCPC4 ADCPC4
extern volatile unsigned int  ADCPC4 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC4BITS {
  union {
    struct {
      unsigned TRGSRC8:5;
      unsigned SWTRG8:1;
      unsigned PEND8:1;
      unsigned IRQEN8:1;
      unsigned TRGSRC9:5;
      unsigned SWTRG9:1;
      unsigned PEND9:1;
      unsigned IRQEN9:1;
    };
    struct {
      unsigned TRGSRC80:1;
      unsigned TRGSRC81:1;
      unsigned TRGSRC82:1;
      unsigned TRGSRC83:1;
      unsigned TRGSRC84:1;
      unsigned :3;
      unsigned TRGSRC90:1;
      unsigned TRGSRC91:1;
      unsigned TRGSRC92:1;
      unsigned TRGSRC93:1;
      unsigned TRGSRC94:1;
    };
  };
} ADCPC4BITS;
extern volatile ADCPC4BITS ADCPC4bits __attribute__((__sfr__));

#define ADCPC5 ADCPC5
extern volatile unsigned int  ADCPC5 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC5BITS {
  union {
    struct {
      unsigned TRGSRC10:5;
      unsigned SWTRG10:1;
      unsigned PEND10:1;
      unsigned IRQEN10:1;
      unsigned TRGSRC11:5;
      unsigned SWTRG11:1;
      unsigned PEND11:1;
      unsigned IRQEN11:1;
    };
    struct {
      unsigned TRGSRC100:1;
      unsigned TRGSRC101:1;
      unsigned TRGSRC102:1;
      unsigned TRGSRC103:1;
      unsigned TRGSRC104:1;
      unsigned :3;
      unsigned TRGSRC110:1;
      unsigned TRGSRC111:1;
      unsigned TRGSRC112:1;
      unsigned TRGSRC113:1;
      unsigned TRGSRC114:1;
    };
  };
} ADCPC5BITS;
extern volatile ADCPC5BITS ADCPC5bits __attribute__((__sfr__));

#define ADCPC6 ADCPC6
extern volatile unsigned int  ADCPC6 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC6BITS {
  union {
    struct {
      unsigned TRGSRC12:5;
      unsigned SWTRG12:1;
      unsigned PEND12:1;
      unsigned IRQEN12:1;
    };
    struct {
      unsigned TRGSRC120:1;
      unsigned TRGSRC121:1;
      unsigned TRGSRC122:1;
      unsigned TRGSRC123:1;
      unsigned TRGSRC124:1;
    };
  };
} ADCPC6BITS;
extern volatile ADCPC6BITS ADCPC6bits __attribute__((__sfr__));

#define ADCBUF0 ADCBUF0
extern volatile unsigned int  ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile unsigned int  ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile unsigned int  ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile unsigned int  ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile unsigned int  ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile unsigned int  ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile unsigned int  ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile unsigned int  ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile unsigned int  ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile unsigned int  ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile unsigned int  ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile unsigned int  ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile unsigned int  ADCBUF12 __attribute__((__sfr__));
#define ADCBUF13 ADCBUF13
extern volatile unsigned int  ADCBUF13 __attribute__((__sfr__));
#define ADCBUF14 ADCBUF14
extern volatile unsigned int  ADCBUF14 __attribute__((__sfr__));
#define ADCBUF15 ADCBUF15
extern volatile unsigned int  ADCBUF15 __attribute__((__sfr__));
#define ADCBUF16 ADCBUF16
extern volatile unsigned int  ADCBUF16 __attribute__((__sfr__));
#define ADCBUF17 ADCBUF17
extern volatile unsigned int  ADCBUF17 __attribute__((__sfr__));
#define ADCBUF18 ADCBUF18
extern volatile unsigned int  ADCBUF18 __attribute__((__sfr__));
#define ADCBUF19 ADCBUF19
extern volatile unsigned int  ADCBUF19 __attribute__((__sfr__));
#define ADCBUF20 ADCBUF20
extern volatile unsigned int  ADCBUF20 __attribute__((__sfr__));
#define ADCBUF21 ADCBUF21
extern volatile unsigned int  ADCBUF21 __attribute__((__sfr__));
#define ADCBUF22 ADCBUF22
extern volatile unsigned int  ADCBUF22 __attribute__((__sfr__));
#define ADCBUF23 ADCBUF23
extern volatile unsigned int  ADCBUF23 __attribute__((__sfr__));
#define ADCBUF24 ADCBUF24
extern volatile unsigned int  ADCBUF24 __attribute__((__sfr__));
#define ADCBUF25 ADCBUF25
extern volatile unsigned int  ADCBUF25 __attribute__((__sfr__));
#define DMA0CON DMA0CON
extern volatile unsigned int  DMA0CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA0CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA0CONBITS;
