Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS610.h
#define _ADCPC2_SWTRG4_POSITION                  0x00000005
#define _ADCPC2_SWTRG4_MASK                      0x00000020
#define _ADCPC2_SWTRG4_LENGTH                    0x00000001

#define _ADCPC2_PEND4_POSITION                   0x00000006
#define _ADCPC2_PEND4_MASK                       0x00000040
#define _ADCPC2_PEND4_LENGTH                     0x00000001

#define _ADCPC2_IRQEN4_POSITION                  0x00000007
#define _ADCPC2_IRQEN4_MASK                      0x00000080
#define _ADCPC2_IRQEN4_LENGTH                    0x00000001

#define _ADCPC2_TRGSRC5_POSITION                 0x00000008
#define _ADCPC2_TRGSRC5_MASK                     0x00001F00
#define _ADCPC2_TRGSRC5_LENGTH                   0x00000005

#define _ADCPC2_SWTRG5_POSITION                  0x0000000D
#define _ADCPC2_SWTRG5_MASK                      0x00002000
#define _ADCPC2_SWTRG5_LENGTH                    0x00000001

#define _ADCPC2_PEND5_POSITION                   0x0000000E
#define _ADCPC2_PEND5_MASK                       0x00004000
#define _ADCPC2_PEND5_LENGTH                     0x00000001

#define _ADCPC2_IRQEN5_POSITION                  0x0000000F
#define _ADCPC2_IRQEN5_MASK                      0x00008000
#define _ADCPC2_IRQEN5_LENGTH                    0x00000001

#define _ADCPC2_TRGSRC40_POSITION                0x00000000
#define _ADCPC2_TRGSRC40_MASK                    0x00000001
#define _ADCPC2_TRGSRC40_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC41_POSITION                0x00000001
#define _ADCPC2_TRGSRC41_MASK                    0x00000002
#define _ADCPC2_TRGSRC41_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC42_POSITION                0x00000002
#define _ADCPC2_TRGSRC42_MASK                    0x00000004
#define _ADCPC2_TRGSRC42_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC43_POSITION                0x00000003
#define _ADCPC2_TRGSRC43_MASK                    0x00000008
#define _ADCPC2_TRGSRC43_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC44_POSITION                0x00000004
#define _ADCPC2_TRGSRC44_MASK                    0x00000010
#define _ADCPC2_TRGSRC44_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC50_POSITION                0x00000008
#define _ADCPC2_TRGSRC50_MASK                    0x00000100
#define _ADCPC2_TRGSRC50_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC51_POSITION                0x00000009
#define _ADCPC2_TRGSRC51_MASK                    0x00000200
#define _ADCPC2_TRGSRC51_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC52_POSITION                0x0000000A
#define _ADCPC2_TRGSRC52_MASK                    0x00000400
#define _ADCPC2_TRGSRC52_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC53_POSITION                0x0000000B
#define _ADCPC2_TRGSRC53_MASK                    0x00000800
#define _ADCPC2_TRGSRC53_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC54_POSITION                0x0000000C
#define _ADCPC2_TRGSRC54_MASK                    0x00001000
#define _ADCPC2_TRGSRC54_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC6_POSITION                 0x00000000
#define _ADCPC3_TRGSRC6_MASK                     0x0000001F
#define _ADCPC3_TRGSRC6_LENGTH                   0x00000005

#define _ADCPC3_SWTRG6_POSITION                  0x00000005
#define _ADCPC3_SWTRG6_MASK                      0x00000020
#define _ADCPC3_SWTRG6_LENGTH                    0x00000001

#define _ADCPC3_PEND6_POSITION                   0x00000006
#define _ADCPC3_PEND6_MASK                       0x00000040
#define _ADCPC3_PEND6_LENGTH                     0x00000001

#define _ADCPC3_IRQEN6_POSITION                  0x00000007
#define _ADCPC3_IRQEN6_MASK                      0x00000080
#define _ADCPC3_IRQEN6_LENGTH                    0x00000001

#define _ADCPC3_TRGSRC7_POSITION                 0x00000008
#define _ADCPC3_TRGSRC7_MASK                     0x00001F00
#define _ADCPC3_TRGSRC7_LENGTH                   0x00000005

#define _ADCPC3_SWTRG7_POSITION                  0x0000000D
#define _ADCPC3_SWTRG7_MASK                      0x00002000
#define _ADCPC3_SWTRG7_LENGTH                    0x00000001

#define _ADCPC3_PEND7_POSITION                   0x0000000E
#define _ADCPC3_PEND7_MASK                       0x00004000
#define _ADCPC3_PEND7_LENGTH                     0x00000001

#define _ADCPC3_IRQEN7_POSITION                  0x0000000F
#define _ADCPC3_IRQEN7_MASK                      0x00008000
#define _ADCPC3_IRQEN7_LENGTH                    0x00000001

#define _ADCPC3_TRGSRC60_POSITION                0x00000000
#define _ADCPC3_TRGSRC60_MASK                    0x00000001
#define _ADCPC3_TRGSRC60_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC61_POSITION                0x00000001
#define _ADCPC3_TRGSRC61_MASK                    0x00000002
#define _ADCPC3_TRGSRC61_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC62_POSITION                0x00000002
#define _ADCPC3_TRGSRC62_MASK                    0x00000004
#define _ADCPC3_TRGSRC62_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC63_POSITION                0x00000003
#define _ADCPC3_TRGSRC63_MASK                    0x00000008
#define _ADCPC3_TRGSRC63_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC64_POSITION                0x00000004
#define _ADCPC3_TRGSRC64_MASK                    0x00000010
#define _ADCPC3_TRGSRC64_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC70_POSITION                0x00000008
#define _ADCPC3_TRGSRC70_MASK                    0x00000100
#define _ADCPC3_TRGSRC70_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC71_POSITION                0x00000009
#define _ADCPC3_TRGSRC71_MASK                    0x00000200
#define _ADCPC3_TRGSRC71_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC72_POSITION                0x0000000A
#define _ADCPC3_TRGSRC72_MASK                    0x00000400
#define _ADCPC3_TRGSRC72_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC73_POSITION                0x0000000B
#define _ADCPC3_TRGSRC73_MASK                    0x00000800
#define _ADCPC3_TRGSRC73_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC74_POSITION                0x0000000C
#define _ADCPC3_TRGSRC74_MASK                    0x00001000
#define _ADCPC3_TRGSRC74_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC8_POSITION                 0x00000000
#define _ADCPC4_TRGSRC8_MASK                     0x0000001F
#define _ADCPC4_TRGSRC8_LENGTH                   0x00000005

#define _ADCPC4_SWTRG8_POSITION                  0x00000005
#define _ADCPC4_SWTRG8_MASK                      0x00000020
#define _ADCPC4_SWTRG8_LENGTH                    0x00000001

#define _ADCPC4_PEND8_POSITION                   0x00000006
#define _ADCPC4_PEND8_MASK                       0x00000040
#define _ADCPC4_PEND8_LENGTH                     0x00000001

#define _ADCPC4_IRQEN8_POSITION                  0x00000007
#define _ADCPC4_IRQEN8_MASK                      0x00000080
#define _ADCPC4_IRQEN8_LENGTH                    0x00000001

