Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS610.h
#define _ADCPC4_TRGSRC9_POSITION                 0x00000008
#define _ADCPC4_TRGSRC9_MASK                     0x00001F00
#define _ADCPC4_TRGSRC9_LENGTH                   0x00000005

#define _ADCPC4_SWTRG9_POSITION                  0x0000000D
#define _ADCPC4_SWTRG9_MASK                      0x00002000
#define _ADCPC4_SWTRG9_LENGTH                    0x00000001

#define _ADCPC4_PEND9_POSITION                   0x0000000E
#define _ADCPC4_PEND9_MASK                       0x00004000
#define _ADCPC4_PEND9_LENGTH                     0x00000001

#define _ADCPC4_IRQEN9_POSITION                  0x0000000F
#define _ADCPC4_IRQEN9_MASK                      0x00008000
#define _ADCPC4_IRQEN9_LENGTH                    0x00000001

#define _ADCPC4_TRGSRC80_POSITION                0x00000000
#define _ADCPC4_TRGSRC80_MASK                    0x00000001
#define _ADCPC4_TRGSRC80_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC81_POSITION                0x00000001
#define _ADCPC4_TRGSRC81_MASK                    0x00000002
#define _ADCPC4_TRGSRC81_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC82_POSITION                0x00000002
#define _ADCPC4_TRGSRC82_MASK                    0x00000004
#define _ADCPC4_TRGSRC82_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC83_POSITION                0x00000003
#define _ADCPC4_TRGSRC83_MASK                    0x00000008
#define _ADCPC4_TRGSRC83_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC84_POSITION                0x00000004
#define _ADCPC4_TRGSRC84_MASK                    0x00000010
#define _ADCPC4_TRGSRC84_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC90_POSITION                0x00000008
#define _ADCPC4_TRGSRC90_MASK                    0x00000100
#define _ADCPC4_TRGSRC90_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC91_POSITION                0x00000009
#define _ADCPC4_TRGSRC91_MASK                    0x00000200
#define _ADCPC4_TRGSRC91_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC92_POSITION                0x0000000A
#define _ADCPC4_TRGSRC92_MASK                    0x00000400
#define _ADCPC4_TRGSRC92_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC93_POSITION                0x0000000B
#define _ADCPC4_TRGSRC93_MASK                    0x00000800
#define _ADCPC4_TRGSRC93_LENGTH                  0x00000001

#define _ADCPC4_TRGSRC94_POSITION                0x0000000C
#define _ADCPC4_TRGSRC94_MASK                    0x00001000
#define _ADCPC4_TRGSRC94_LENGTH                  0x00000001

#define _ADCPC5_TRGSRC10_POSITION                0x00000000
#define _ADCPC5_TRGSRC10_MASK                    0x0000001F
#define _ADCPC5_TRGSRC10_LENGTH                  0x00000005

#define _ADCPC5_SWTRG10_POSITION                 0x00000005
#define _ADCPC5_SWTRG10_MASK                     0x00000020
#define _ADCPC5_SWTRG10_LENGTH                   0x00000001

#define _ADCPC5_PEND10_POSITION                  0x00000006
#define _ADCPC5_PEND10_MASK                      0x00000040
#define _ADCPC5_PEND10_LENGTH                    0x00000001

#define _ADCPC5_IRQEN10_POSITION                 0x00000007
#define _ADCPC5_IRQEN10_MASK                     0x00000080
#define _ADCPC5_IRQEN10_LENGTH                   0x00000001

#define _ADCPC5_TRGSRC11_POSITION                0x00000008
#define _ADCPC5_TRGSRC11_MASK                    0x00001F00
#define _ADCPC5_TRGSRC11_LENGTH                  0x00000005

#define _ADCPC5_SWTRG11_POSITION                 0x0000000D
#define _ADCPC5_SWTRG11_MASK                     0x00002000
#define _ADCPC5_SWTRG11_LENGTH                   0x00000001

#define _ADCPC5_PEND11_POSITION                  0x0000000E
#define _ADCPC5_PEND11_MASK                      0x00004000
#define _ADCPC5_PEND11_LENGTH                    0x00000001

#define _ADCPC5_IRQEN11_POSITION                 0x0000000F
#define _ADCPC5_IRQEN11_MASK                     0x00008000
#define _ADCPC5_IRQEN11_LENGTH                   0x00000001

#define _ADCPC5_TRGSRC100_POSITION               0x00000000
#define _ADCPC5_TRGSRC100_MASK                   0x00000001
#define _ADCPC5_TRGSRC100_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC101_POSITION               0x00000001
#define _ADCPC5_TRGSRC101_MASK                   0x00000002
#define _ADCPC5_TRGSRC101_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC102_POSITION               0x00000002
#define _ADCPC5_TRGSRC102_MASK                   0x00000004
#define _ADCPC5_TRGSRC102_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC103_POSITION               0x00000003
#define _ADCPC5_TRGSRC103_MASK                   0x00000008
#define _ADCPC5_TRGSRC103_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC104_POSITION               0x00000004
#define _ADCPC5_TRGSRC104_MASK                   0x00000010
#define _ADCPC5_TRGSRC104_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC110_POSITION               0x00000008
#define _ADCPC5_TRGSRC110_MASK                   0x00000100
#define _ADCPC5_TRGSRC110_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC111_POSITION               0x00000009
#define _ADCPC5_TRGSRC111_MASK                   0x00000200
#define _ADCPC5_TRGSRC111_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC112_POSITION               0x0000000A
#define _ADCPC5_TRGSRC112_MASK                   0x00000400
#define _ADCPC5_TRGSRC112_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC113_POSITION               0x0000000B
#define _ADCPC5_TRGSRC113_MASK                   0x00000800
#define _ADCPC5_TRGSRC113_LENGTH                 0x00000001

#define _ADCPC5_TRGSRC114_POSITION               0x0000000C
#define _ADCPC5_TRGSRC114_MASK                   0x00001000
#define _ADCPC5_TRGSRC114_LENGTH                 0x00000001

#define _ADCPC6_TRGSRC12_POSITION                0x00000000
#define _ADCPC6_TRGSRC12_MASK                    0x0000001F
#define _ADCPC6_TRGSRC12_LENGTH                  0x00000005

#define _ADCPC6_SWTRG12_POSITION                 0x00000005
#define _ADCPC6_SWTRG12_MASK                     0x00000020
#define _ADCPC6_SWTRG12_LENGTH                   0x00000001

#define _ADCPC6_PEND12_POSITION                  0x00000006
#define _ADCPC6_PEND12_MASK                      0x00000040
#define _ADCPC6_PEND12_LENGTH                    0x00000001

#define _ADCPC6_IRQEN12_POSITION                 0x00000007
#define _ADCPC6_IRQEN12_MASK                     0x00000080
#define _ADCPC6_IRQEN12_LENGTH                   0x00000001

#define _ADCPC6_TRGSRC120_POSITION               0x00000000
#define _ADCPC6_TRGSRC120_MASK                   0x00000001
#define _ADCPC6_TRGSRC120_LENGTH                 0x00000001

#define _ADCPC6_TRGSRC121_POSITION               0x00000001
#define _ADCPC6_TRGSRC121_MASK                   0x00000002
#define _ADCPC6_TRGSRC121_LENGTH                 0x00000001

#define _ADCPC6_TRGSRC122_POSITION               0x00000002
#define _ADCPC6_TRGSRC122_MASK                   0x00000004
#define _ADCPC6_TRGSRC122_LENGTH                 0x00000001

