Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GS610.h
#define _PWMCON9_TRGSTAT_POSITION                0x0000000D
#define _PWMCON9_TRGSTAT_MASK                    0x00002000
#define _PWMCON9_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON9_CLSTAT_POSITION                 0x0000000E
#define _PWMCON9_CLSTAT_MASK                     0x00004000
#define _PWMCON9_CLSTAT_LENGTH                   0x00000001

#define _PWMCON9_FLTSTAT_POSITION                0x0000000F
#define _PWMCON9_FLTSTAT_MASK                    0x00008000
#define _PWMCON9_FLTSTAT_LENGTH                  0x00000001

#define _IOCON9_OSYNC_POSITION                   0x00000000
#define _IOCON9_OSYNC_MASK                       0x00000001
#define _IOCON9_OSYNC_LENGTH                     0x00000001

#define _IOCON9_SWAP_POSITION                    0x00000001
#define _IOCON9_SWAP_MASK                        0x00000002
#define _IOCON9_SWAP_LENGTH                      0x00000001

#define _IOCON9_CLDAT_POSITION                   0x00000002
#define _IOCON9_CLDAT_MASK                       0x0000000C
#define _IOCON9_CLDAT_LENGTH                     0x00000002

#define _IOCON9_FLTDAT_POSITION                  0x00000004
#define _IOCON9_FLTDAT_MASK                      0x00000030
#define _IOCON9_FLTDAT_LENGTH                    0x00000002

#define _IOCON9_OVRDAT_POSITION                  0x00000006
#define _IOCON9_OVRDAT_MASK                      0x000000C0
#define _IOCON9_OVRDAT_LENGTH                    0x00000002

#define _IOCON9_OVRENL_POSITION                  0x00000008
#define _IOCON9_OVRENL_MASK                      0x00000100
#define _IOCON9_OVRENL_LENGTH                    0x00000001

#define _IOCON9_OVRENH_POSITION                  0x00000009
#define _IOCON9_OVRENH_MASK                      0x00000200
#define _IOCON9_OVRENH_LENGTH                    0x00000001

#define _IOCON9_PMOD_POSITION                    0x0000000A
#define _IOCON9_PMOD_MASK                        0x00000C00
#define _IOCON9_PMOD_LENGTH                      0x00000002

#define _IOCON9_POLL_POSITION                    0x0000000C
#define _IOCON9_POLL_MASK                        0x00001000
#define _IOCON9_POLL_LENGTH                      0x00000001

#define _IOCON9_POLH_POSITION                    0x0000000D
#define _IOCON9_POLH_MASK                        0x00002000
#define _IOCON9_POLH_LENGTH                      0x00000001

#define _IOCON9_PENL_POSITION                    0x0000000E
#define _IOCON9_PENL_MASK                        0x00004000
#define _IOCON9_PENL_LENGTH                      0x00000001

#define _IOCON9_PENH_POSITION                    0x0000000F
#define _IOCON9_PENH_MASK                        0x00008000
#define _IOCON9_PENH_LENGTH                      0x00000001

#define _FCLCON9_FLTMOD_POSITION                 0x00000000
#define _FCLCON9_FLTMOD_MASK                     0x00000003
#define _FCLCON9_FLTMOD_LENGTH                   0x00000002

#define _FCLCON9_FLTPOL_POSITION                 0x00000002
#define _FCLCON9_FLTPOL_MASK                     0x00000004
#define _FCLCON9_FLTPOL_LENGTH                   0x00000001

#define _FCLCON9_FLTSRC_POSITION                 0x00000003
#define _FCLCON9_FLTSRC_MASK                     0x000000F8
#define _FCLCON9_FLTSRC_LENGTH                   0x00000005

#define _FCLCON9_CLMOD_POSITION                  0x00000008
#define _FCLCON9_CLMOD_MASK                      0x00000100
#define _FCLCON9_CLMOD_LENGTH                    0x00000001

#define _FCLCON9_CLPOL_POSITION                  0x00000009
#define _FCLCON9_CLPOL_MASK                      0x00000200
#define _FCLCON9_CLPOL_LENGTH                    0x00000001

#define _FCLCON9_CLSRC_POSITION                  0x0000000A
#define _FCLCON9_CLSRC_MASK                      0x00007C00
#define _FCLCON9_CLSRC_LENGTH                    0x00000005

#define _FCLCON9_IFLTMOD_POSITION                0x0000000F
#define _FCLCON9_IFLTMOD_MASK                    0x00008000
#define _FCLCON9_IFLTMOD_LENGTH                  0x00000001

#define _DTR9_DTR9_POSITION                      0x00000000
#define _DTR9_DTR9_MASK                          0x00003FFF
#define _DTR9_DTR9_LENGTH                        0x0000000E

#define _ALTDTR9_ALTDTR9_POSITION                0x00000000
#define _ALTDTR9_ALTDTR9_MASK                    0x00003FFF
#define _ALTDTR9_ALTDTR9_LENGTH                  0x0000000E

#define _TRIG9_TRGCMP_POSITION                   0x00000003
#define _TRIG9_TRGCMP_MASK                       0x0000FFF8
#define _TRIG9_TRGCMP_LENGTH                     0x0000000D

#define _TRGCON9_TRGSTRT_POSITION                0x00000000
#define _TRGCON9_TRGSTRT_MASK                    0x0000003F
#define _TRGCON9_TRGSTRT_LENGTH                  0x00000006

#define _TRGCON9_DTM_POSITION                    0x00000007
#define _TRGCON9_DTM_MASK                        0x00000080
#define _TRGCON9_DTM_LENGTH                      0x00000001

#define _TRGCON9_TRGDIV_POSITION                 0x0000000C
#define _TRGCON9_TRGDIV_MASK                     0x0000F000
#define _TRGCON9_TRGDIV_LENGTH                   0x00000004

#define _STRIG9_STRGCMP_POSITION                 0x00000003
#define _STRIG9_STRGCMP_MASK                     0x0000FFF8
#define _STRIG9_STRGCMP_LENGTH                   0x0000000D

#define _PWMCAP9_PWMCAP9_POSITION                0x00000003
#define _PWMCAP9_PWMCAP9_MASK                    0x0000FFF8
#define _PWMCAP9_PWMCAP9_LENGTH                  0x0000000D

#define _LEBCON9_BPLL_POSITION                   0x00000000
#define _LEBCON9_BPLL_MASK                       0x00000001
#define _LEBCON9_BPLL_LENGTH                     0x00000001

#define _LEBCON9_BPLH_POSITION                   0x00000001
#define _LEBCON9_BPLH_MASK                       0x00000002
#define _LEBCON9_BPLH_LENGTH                     0x00000001

#define _LEBCON9_BPHL_POSITION                   0x00000002
#define _LEBCON9_BPHL_MASK                       0x00000004
#define _LEBCON9_BPHL_LENGTH                     0x00000001

#define _LEBCON9_BPHH_POSITION                   0x00000003
#define _LEBCON9_BPHH_MASK                       0x00000008
#define _LEBCON9_BPHH_LENGTH                     0x00000001

#define _LEBCON9_BCL_POSITION                    0x00000004
#define _LEBCON9_BCL_MASK                        0x00000010
#define _LEBCON9_BCL_LENGTH                      0x00000001

